load_test/t2_xlarge/tsung.xml
<?xml version="1.0"?><tsung loglevel="notice">

  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="15000"/>
  </clients>

  <servers>
    <server host="dinner-pal-dev.gzey4mivpj.us-west-2.elasticbeanstalk.com" port="80" type="tcp"/>
  </servers>

  <load>
    <arrivalphase phase="1" duration="30" unit="second">
      <users arrivalrate="1" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="2" duration="30" unit="second">
      <users arrivalrate="2" unit="second"/>
    </arrivalphase>

    <arrivalphase phase="3" duration="30" unit="second">
      <users arrivalrate="4" unit="second"/>
    </arrivalphase>

    <arrivalphase phase="4" duration="30" unit="second">
      <users arrivalrate="8" unit="second"/>
    </arrivalphase>

    <arrivalphase phase="5" duration="30" unit="second">
        <users arrivalrate="16" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="6" duration="30" unit="second">
        <users arrivalrate="32" unit="second"/>
    </arrivalphase>

  </load>

  <options>
    <option name="global_ack_timeout" value="5000"/>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>
  <sessions>
    <session name="Hit all endpoints" weight="1" type="ts_http">
      <request>
        <dyn_variable name="authenticity_token"/>
        <http url="/users/sign_in" version="1.1" method="GET"/>
      </request>

      <thinktime value="3" random="true"/>

      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),http_uri:encode(Val) end.">
        <var name="encoded_authenticity_token"/>
      </setdynvars>
    
      <setdynvars sourcetype="random_number" start="1" end="100">
        <var name="user_email_num"/>
      </setdynvars>

      <request subst="true">
        <http url="/users/sign_in" version="1.1" method="POST" content_type="application/x-www-form-urlencoded" contents="authenticity_token=%%_encoded_authenticity_token%%&amp;user%5Bemail%5D=tsung%%_user_email_num%%@dinner-pal.com&amp;user%5Bpassword%5D=password">
        </http>
      </request>

      <request subst="true">
        <http url="/browse" method="GET"/>
      </request>

      <thinktime value="10" random="true"/>

      <setdynvars sourcetype="random_number" start="1" end="100">
        <var name="listing_id"/>
      </setdynvars>

      <request subst="true">
        <http url="/listings/%%_listing_id%%" method="GET"/>
      </request>

      <thinktime value="10" random="true"/>

      <request subst="true">
        <dyn_variable name="authenticity_token"/>
        <dyn_variable name="reservation_diner_id_array" xpath="//input[@id='reservation_diner_id']/@value"/>
        <http url="/reservations/new?listing_id=%%_listing_id%%" version="1.1" method="GET"/>
      </request>

      <foreach name="temp" in="reservation_diner_id_array">
        <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(temp,DynVars),http_uri:encode(Val) end.">
          <var name="reservation_diner_id"/>
        </setdynvars>
      </foreach>

      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),http_uri:encode(Val) end.">
        <var name="encoded_authenticity_token"/>
      </setdynvars>

      <request subst="true">
        <dyn_variable name="redirect" re="Location: (http://.*)\r"/>
	      <dyn_variable name="reservation_id" re="Location: http://.*/reservations/([0-9]+)\r"/>
        <http url="/reservations" version="1.1" method="POST" content_type="application/x-www-form-urlencoded" contents="authenticity_token=%%_encoded_authenticity_token%%&amp;reservation%5Blisting_id%5D=%%_listing_id%%&amp;reservation%5Bdiner_id%5D=%%_reservation_diner_id%%&amp;reservation%5Bstart_time%281i%29%5D=2019&amp;reservation%5Bstart_time%282i%29%5D=12&amp;reservation%5Bstart_time%283i%29%5D=1&amp;reservation%5Bstart_time%284i%29%5D=21&amp;reservation%5Bstart_time%285i%29%5D=45&amp;reservation%5Bend_time%281i%29%5D=2019&amp;reservation%5Bend_time%282i%29%5D=12&amp;reservation%5Bend_time%283i%29%5D=2&amp;reservation%5Bend_time%284i%29%5D=21&amp;reservation%5Bend_time%285i%29%5D=45&amp;commit=Create+Reservation">
        </http>
      </request>

      <request subst="true">
        <dyn_variable name="authenticity_token"/>
        <http url="%%_redirect%%" method="GET"/>
      </request>

      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),http_uri:encode(Val) end.">
        <var name="encoded_authenticity_token"/>
      </setdynvars>

      <request subst="true">
	      <http url="/reviews" version="1.1" method="POST" content_type="application/x-www-form-urlencoded" contents="authenticity_token=%%_encoded_authenticity_token%%&amp;review%5Brating%5D=4&amp;review%5Bcontent%5D=thisfoodwasgood&amp;review%5Blisting_id%5D=%%_listing_id%%&amp;commit=Create+Review">
	      </http>
      </request>

      <request>
        <dyn_variable name="authenticity_token"/>
        <http url="/reservations" method="GET"/>
      </request>

      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),http_uri:encode(Val) end.">
        <var name="encoded_authenticity_token"/>
      </setdynvars>

      <request subst="true">
	      <http url="/reservations/%%_reservation_id%%" version="1.1" method="POST" content_type="application/x-www-form-urlencoded" contents="_method=delete&amp;authenticity_token=%%_encoded_authenticity_token%%">
	      </http>
      </request>

      <request>
        <http url="/listings" method="GET"/>
      </request>

      <request>
        <dyn_variable name="authenticity_token"/>
        <http url="/listings/new" method="GET"/>
      </request>

      <setdynvars sourcetype="eval" code="fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),http_uri:encode(Val) end.">
        <var name="encoded_authenticity_token"/>
      </setdynvars>

      <request subst="all_except_body">
        <dyn_variable name="redirect" re="Location: (http://.*)\r"/>
        <dyn_variable name="listing_id" re="Location: http://.*/listings/([0-9]+)\r"/>
        <http url="/listings" contents_from_file="./multipart-form-data-windows-format.bin" content_type="multipart/form-data; boundary=----WebKitFormBoundaryJk8zyR5zfUK7vmJ1" method="POST">
          <http_header name="X-CSRF-Token" value="%%_authenticity_token%%"/>
          <http_header name="Accept" value="text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3"/>
          <http_header name="Accept-Encoding" value="gzip, deflate"/>
          <http_header name="Accept-Language" value="en-US,en;q=0.9"/>
	      </http>
      </request>

      <request subst="true">
        <http url="%%_redirect%%" method="GET"/>
      </request>

      <request subst="true">
        <dyn_variable name="redirect" re="Location: (http://.*)\r"/>
        <http url="/users/sign_out" method="GET"/>
      </request>

      <request subst="true">
        <http url="%%_redirect%%" method="GET"/>
      </request>

      <setdynvars sourcetype="eval" code="fun( {Pid, DynVars} ) ->         io:format([126, $p, 126, $n, 126, $n], [DynVars]),         ok end.">
        <var name="dump"/>
      </setdynvars>
    </session>
  </sessions>
</tsung>